{
    "name": "Barbarian",
    "description": "For some, their rage springs from a communion with fierce animal spirits. Others draw from a roiling reservoir of anger at a world full of pain. For every barbarian, rage is a power that fuels not just a battle frenzy but also uncanny reflexes, resilience, and feats of strength.",
    "table": {
        "1": {
            "Level": "1st",
            "Proficiency Bonus": "+2",
            "Features": "Rage, Unarmored Defense",
            "Rages": "2",
            "Rage Damage": "+2"
        },
        "2": {
            "Level": "2nd",
            "Proficiency Bonus": "+2",
            "Features": "Reckless Attack, Danger Sense",
            "Rages": "2",
            "Rage Damage": "+2"
        },
        "3": {
            "Level": "3rd",
            "Proficiency Bonus": "+2",
            "Features": "Primal Path, Primal Knowledge (Optional)",
            "Rages": "3",
            "Rage Damage": "+2"
        },
        "4": {
            "Level": "4th",
            "Proficiency Bonus": "+2",
            "Features": "Ability Score Improvement",
            "Rages": "3",
            "Rage Damage": "+2"
        },
        "5": {
            "Level": "5th",
            "Proficiency Bonus": "+3",
            "Features": "Extra Attack, Fast Movement",
            "Rages": "3",
            "Rage Damage": "+2"
        },
        "6": {
            "Level": "6th",
            "Proficiency Bonus": "+3",
            "Features": "Path feature",
            "Rages": "4",
            "Rage Damage": "+2"
        },
        "7": {
            "Level": "7th",
            "Proficiency Bonus": "+3",
            "Features": "Feral Instinct, Instinctive Pounce (Optional)",
            "Rages": "4",
            "Rage Damage": "+2"
        },
        "8": {
            "Level": "8th",
            "Proficiency Bonus": "+3",
            "Features": "Ability Score Improvement",
            "Rages": "4",
            "Rage Damage": "+2"
        },
        "9": {
            "Level": "9th",
            "Proficiency Bonus": "+4",
            "Features": "Brutal Critical (1 die)",
            "Rages": "4",
            "Rage Damage": "+3"
        },
        "10": {
            "Level": "10th",
            "Proficiency Bonus": "+4",
            "Features": "Path feature, Primal Knowledge (Optional)",
            "Rages": "4",
            "Rage Damage": "+3"
        },
        "11": {
            "Level": "11th",
            "Proficiency Bonus": "+4",
            "Features": "Relentless Rage",
            "Rages": "4",
            "Rage Damage": "+3"
        },
        "12": {
            "Level": "12th",
            "Proficiency Bonus": "+4",
            "Features": "Ability Score Improvement",
            "Rages": "5",
            "Rage Damage": "+3"
        },
        "13": {
            "Level": "13th",
            "Proficiency Bonus": "+5",
            "Features": "Brutal Critical (2 dice)",
            "Rages": "5",
            "Rage Damage": "+3"
        },
        "14": {
            "Level": "14th",
            "Proficiency Bonus": "+5",
            "Features": "Path feature",
            "Rages": "5",
            "Rage Damage": "+3"
        },
        "15": {
            "Level": "15th",
            "Proficiency Bonus": "+5",
            "Features": "Persistent Rage",
            "Rages": "5",
            "Rage Damage": "+3"
        },
        "16": {
            "Level": "16th",
            "Proficiency Bonus": "+5",
            "Features": "Ability Score Improvement",
            "Rages": "5",
            "Rage Damage": "+4"
        },
        "17": {
            "Level": "17th",
            "Proficiency Bonus": "+6",
            "Features": "Brutal Critical (3 dice)",
            "Rages": "6",
            "Rage Damage": "+4"
        },
        "18": {
            "Level": "18th",
            "Proficiency Bonus": "+6",
            "Features": "Indomitable Might",
            "Rages": "6",
            "Rage Damage": "+4"
        },
        "19": {
            "Level": "19th",
            "Proficiency Bonus": "+6",
            "Features": "Ability Score Improvement",
            "Rages": "6",
            "Rage Damage": "+4"
        },
        "20": {
            "Level": "20th",
            "Proficiency Bonus": "+6",
            "Features": "Primal Champion",
            "Rages": "Unlimited",
            "Rage Damage": "+4"
        }
    },
    "hit points": {
        "Hit Dice": "Hit Dice: 1d12 per barbarian level",
        "Base Hit Points": "\nHit Points at 1st Level: 12 + your Constitution modifier",
        "Hit Points Per Level": "Hit Dice: 1d12 per barbarian level\nHit Points at 1st Level: 12 + your Constitution modifier"
    },
    "proficiencies": {
        "Armor Proficiency": "Light armor, medium armor, shields",
        "Weapon Proficiency": "Simple weapons, martial weapons",
        "Tool Proficiency": "None",
        "Saving Thow Proficiency": "Strength, Constitution",
        "Skill Proficiency": "Choose two from Animal Handling, Athletics, Intimidation, Nature, Perception, and Survival"
    },
    "equipment": {
        "Equipment 1": "(a) a greataxe or (b) any martial melee weapon",
        "Equipment 2": "(a) two handaxes or (b) any simple weapon",
        "Equipment 3": "An explorer's pack and four javelins"
    },
    "class features": {
        "Rage": [
            "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.",
            "While raging, you gain the following benefits if you aren't wearing heavy armor:",
            "You have advantage on Strength checks and Strength saving throws.When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table.You have resistance to bludgeoning, piercing, and slashing damage.",
            "If you are able to cast spells, you can't cast them or concentrate on them while raging.",
            "Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.",
            "Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again."
        ],
        "Unarmored Defense": [
            "While you are not wearing any armor, your armor class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
        ],
        "Danger Sense": [
            "At 2nd level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated."
        ],
        "Reckless Attack": [
            "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
        ],
        "Primal Path": [
            "At 3rd level, you choose a path that shapes the nature of your rage. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels.",
            "PathSourceAncestral GuardianXanathar's Guide to EverythingBattleragerSword Coast Adventurer's GuideBeastTasha's Cauldron of EverythingBerserkerPlayer's HandbookStorm HeraldXanathar's Guide to EverythingTotem WarriorPlayer's HandbookWild MagicTasha's Cauldron of EverythingZealotXanathar's Guide to EverythingUnearthed ArcanaGiantUnearthed Arcana 83 - Giant OptionsD&D Beyond Partnered ContentDepthsLegends of Runeterra: Dark Tides of BilgewaterThe following subclass is unofficial homebrew created by WOTC affiliated DM, Matthew MercerJuggernautTal'Dorei Campaign GuideArchived Unearthed ArcanaBeastUnearthed Arcana 67 - Subclasses, Part 1Wild SoulUnearthed Arcana 60 - Barbarian and Monk"
        ],
        "Primal Knowledge (Optional)": [
            "When you reach 3rd level and again at 10th level, you gain proficiency in one skill of your choice from the list of skills available to barbarians at 1st level."
        ],
        "Ability Score Improvement": [
            "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
        ],
        "Extra Attack": [
            "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
        ],
        "Fast Movement": [
            "Starting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor."
        ],
        "Feral Instinct": [
            "By 7th level, your instincts are so honed that you have advantage on initiative rolls.",
            "Additionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
        ],
        "Instinctive Pounce (Optional)": [
            "At 7th level, as part of the bonus action you take to enter your rage, you can move up to half your speed."
        ],
        "Brutal Critical": [
            "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack.",
            "This increases to two additional dice at 13th level and three additional dice at 17th level."
        ],
        "Relentless Rage": [
            "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.",
            "Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
        ],
        "Persistent Rage": [
            "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."
        ],
        "Indomitable Might": [
            "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."
        ],
        "Primal Champion": [
            "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
        ]
    }
}